apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
		}
		break;
			
		default:
		{
			printf ( "This command has not yet been decoded\n" );
		}
		break;
		
	}
	
}


//-----------------------------------------------------------------------------
//	PrintTimeStamp
//-----------------------------------------------------------------------------

static void
PrintTimeStamp ( void )
{
	
	time_t		currentTime = time ( NULL );
	
	if ( prev_usecs == 0 )
	{
		delta_usecs = 0;
	}
	else
	{
		delta_usecs = current_usecs - prev_usecs;
	}

	prev_usecs = current_usecs;
	
/*
	
	if ( delta_usecs > (100 * kMicrosecondsPerMillisecond )
	{
		printf ( "*** " );
	}
	else
	{
		printf ( "    " );
	}

*/
	
	printf ( "%-8.8s [%lld][%10lld us]", &( ctime ( &currentTime )[11] ), current_usecs, delta_usecs );
	
}

//-----------------------------------------------------------------------------
//	CollectTrace
//-----------------------------------------------------------------------------

static void
CollectTrace ( void )
{
	
	int				mib[6];
	int 			index;
	int				count;
	size_t 			needed;
	kbufinfo_t 		bufinfo = { 0, 0, 0, 0, 0 };
	
	/* Get kernel buffer information */
	GetTraceBufferInfo ( &bufinfo );
	
	needed = bufinfo.nkdbufs * sizeof ( kd_buf );
	mib[0] = CTL_KERN;
	mib[1] = KERN_KDEBUG;
	mib[2] = KERN_KDREADTR;		
	mib[3] = 0;
	mib[4] = 0;
	mib[5] = 0;		/* no flags */
	
	if ( sysctl ( mib, 3, gTraceBuffer, &needed, NULL, 0 ) < 0 )
		Quit ( "trace facility failure, KERN_KDREADTR\n" );
	
	count = needed;
	
	if ( bufinfo.flags & KDBG_WRAPPED )
	{
		
		EnableTraceBuffer ( 0 );
		EnableTraceBuffer ( 1 );
		
	}
	
	for ( index = 0; index < count; index++ )
	{
		
		int 				debugID;
		int 				type;
		uint64_t 			now;
		const char *		errorString;
		
		debugID = gTraceBuffer[index].debugid;
		type	= debugID & ~( DBG_FUNC_START | DBG_FUNC_END );
		
		now = gTraceBuffer[index].timestamp & KDBG_TIMESTAMP_MASK;
		current_usecs = ( int64_t )( now / gDivisor );
		
		if ( ( type >= 0x05278800 ) && ( type <= 0x05278BFC ) && ( type != kCDBLog2Code ) )
		{
			PrintTimeStamp ( );
		}
		
		switch ( type )
		{
		
#pragma mark -
#pragma mark *** Generic UMC Codes ***
#pragma mark -
			
			case kAbortedTaskCode:
			{
				printf ( "[%10p] Task %p Aborted!!!\n", ( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kAbortCurrentSCSITaskCode:
			{
				printf ( "[%10p] Aborted currentTask %p DeviceAttached = %d ConsecutiveResetCount = %d\n",
						( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2,
						( int ) gTraceBuffer[index].arg3, ( int ) gTraceBuffer[index].arg4 );
			}
			break;
				
			case kCompleteSCSICommandCode:
			{
				
				printf ( "[%10p] Task %p Completed with serviceResponse = %d taskStatus = 0x%x\n",
						( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2,
						( int ) gTraceBuffer[index].arg3, ( int ) gTraceBuffer[index].arg4 );
				PrintTimeStamp ( );
				printf ( "[%10p] -------------------------------------------------\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kCompletingCommandWithErrorCode:
			{
				printf ( "[%10p] !!!!! Hark !!!!! Completing command with an ERROR status!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
                
			case kLUNConfigurationCompleteCode:
			{
				printf ( "[%10p] MaxLUN = %u\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kNewCommandWhileTerminatingCode:
			{
				printf ( "[%10p] Task = %p received while terminating!!!\n", ( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kIOUMCStorageCharacDictFoundCode:
			{
				printf ( "[%10p] This device has a USB Characteristics Dictionary\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kNoProtocolForDeviceCode:
			{
				printf ( "[%10p] !!! NO USB TRANSPORT PROTOCOL FOR THIS DEVICE !!!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kIOUSBMassStorageClassStartCode:
			{
				printf ( "[%10p] Starting up!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kIOUSBMassStorageClassStopCode:
			{
				printf ( "[%10p] Stopping!\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kAtUSBAddressCode:
			{
				printf ( "[%10p] @ USB Address: %u\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kMessagedCalledCode:
			{
				printf ( "[%10p] Message : %x received\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
				PrintTimeStamp ( );
				printf ( "[%10p] -------------------------------------------------\n", ( void * ) gTraceBuffer[index].arg1 );
			}
			break;
			
			case kWillTerminateCalledCode:
			{
				printf ( "[%10p] willTerminate called, CurrentInterface=%p, isInactive=%u\n", 
					( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );
			}
			break;
			
			case kDidTerminateCalledCode:
			{
				printf ( "[%10p] didTerminate called, fTerminationDeferred=%u\n", 
						( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
			}
			break;
			
			case kCDBLog1Code:
			{

				UInt8 *			cdbData;
				unsigned int	i;
				
				printf ( "[%10p] Request %p\n", ( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
				PrintTimeStamp ( );
				printf ( "[%10p] ", ( void * ) gTraceBuffer[index].arg1 );
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg3;
				
				for ( i = 0; i < 4; i++ )
				{
					fullCDB [i] = cdbData[i];
					printf ( "0x%02X : ", cdbData[i] );
				}
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg4;
				
				for ( i = 0; i < 4; i++ )
				{
					fullCDB [i+4] = cdbData[i];
					printf ( "0x%02X : ", cdbData[i] );
				}
				
			}
			break;		
			
			case kCDBLog2Code:
			{

				UInt8 *			cdbData;
				unsigned int 	i;
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg3;
				
				for ( i = 0; i < 4; i++ )
				{
					fullCDB [i+8] = cdbData[i];
					printf ( "0x%02X : ", cdbData[i] );
				}
				
				cdbData = ( UInt8 * ) &gTraceBuffer[index].arg4;
				
				for ( i = 0; i < 3; i++ )
				{
					fullCDB [i+12] = cdbData[i];
					printf ( "0x%02X : ", cdbData[i] );
				}
				
				fullCDB [i+12] = cdbData[i];
				printf ( "0x%02X\n", cdbData[i] );
				
				PrintTimeStamp ( );
				printf ( "[%10p] ", ( void * ) gTraceBuffer[index].arg1 );
				PrintSCSICommand ( );
				
