apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
			}
			break;	
			
			case kClearEndPointStallCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%10p] ClearFeatureEndpointStall status=%s (0x%x), endpoint=%u\n", 
						( void * ) gTraceBuffer[index].arg1, errorString, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
			case kGetEndPointStatusCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%10p] GetEndpointStatus status=%s (0x%x), endpoint=%u\n", 
						( void * ) gTraceBuffer[index].arg1, errorString, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );		
				
			}
			break;
			
			case kHandlePowerOnUSBResetCode:
			{
				
				printf ( "[%10p] USB Device Reset on WAKE from SLEEP\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kUSBDeviceResetWhileTerminatingCode:
			{
				
				printf ( "[%10p] Termination started before device reset could be initiated! fTerminating=%u, isInactive=%u\n", 
                            ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
			case kUSBDeviceResetAfterDisconnectCode:
			{
				
				printf ( "[%10p] Device reset was attempted after the device had been disconnected\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kUSBDeviceResetReturnedCode:
			{
				
				printf ( "[%10p] DeviceReset returned: 0x%08x\n", ( void * ) gTraceBuffer[index].arg1, ( unsigned int ) gTraceBuffer[index].arg2 );
				
			}
			break;
                
            case kDeviceInformationCode:
            {
                errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%10p] Device Information status=%s DeviceInformation=0x%x\n", ( void * ) gTraceBuffer[index].arg1,
                        errorString, ( int ) gTraceBuffer[index].arg3 );
			}
            break;
                
            case kSuspendPortCode:
            {
                
                errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
                if ( gTraceBuffer[index].arg3 == 0 )
                {
                    printf ( "[%10p] Suspend Port (RESUME) returned status=%s\n", ( void * ) gTraceBuffer[index].arg1, errorString );
                }
                
                else
                {
                    printf ( "[%10p] Suspend Port (SUSPEND) returned status=%s\n", ( void * ) gTraceBuffer[index].arg1,  errorString );
                }
                
            }
            break;
                
            case kSubclassUseCode:
            {
                
                // This is special code that we let our subclasses use. We have a helper function to handle these.
                ProcessSubclassTracePoint ( index );
                
            }
            break;
			
#pragma mark -
#pragma mark *** Control Bulk Interrupt ( CBI ) Codess ***
#pragma mark -
			
			case kCBIProtocolDeviceDetectedCode:
			{
				
				printf ( "[%10p] CBI transport protocol device\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kCBICommandAlreadyInProgressCode:
			{
			
				if ( gHideBusyRejectedCommands == FALSE )
				{
					
					printf ( "[%10p] CBI - Unable to accept task %p, still working on previous command\n", 
								( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
					
				}
				
			}
			break;
			
			case kCBISendSCSICommandReturnedCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg3 );
				printf ( "[%10p] CBI - SCSI Task %p was sent with status %s (0x%x)\n", 
							( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, errorString, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
#pragma mark -
#pragma mark *** Bulk-Only Protocol Codes ***
#pragma mark -
			
			case kBODeviceDetectedCode:
			{
				
				printf ( "[%10p] BULK-ONLY transport protocol device\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kBOCommandAlreadyInProgressCode:
			{
				
				if ( gHideBusyRejectedCommands == FALSE )
				{
					
					printf ( "[%10p] B0 - Unable to accept task %p, still working on previous request\n", 
								( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2 );
					
				}
				
			}
			break;
			
			case kBOSendSCSICommandReturnedCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg3 );
				printf ( "[%10p] BO - SCSI Task %p was sent with status %s (0x%x)\n", 
								( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, errorString, ( unsigned int ) gTraceBuffer[index].arg3 );				
				
			}
			break;
			
			case kBOPreferredMaxLUNCode:
			{
				
				printf ( "[%10p] BO - Preferred MaxLUN: %d\n", 
							( void * ) gTraceBuffer[index].arg1, (int) gTraceBuffer[index].arg2 );
				
			}
			break;
			
			case kBOGetMaxLUNReturnedCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%10p] BO - GetMaxLUN returned: %s (0x%x), triedReset=%u, MaxLun: %d\n", 
								( void * ) gTraceBuffer[index].arg1, errorString, ( unsigned int ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg4, ( unsigned int ) gTraceBuffer[index].arg3 );
				
			}
			break;
			
			case kBOCBWDescriptionCode:
			{
				
				printf ( "[%10p] BO - Request %p, LUN: %u, CBW Tag: %u (0x%x)\n", 
							( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg2, ( unsigned int ) gTraceBuffer[index].arg3, ( unsigned int ) gTraceBuffer[index].arg4, ( unsigned int ) gTraceBuffer[index].arg4 );
				
			}
			break;
			
			case kBOCBWBulkOutWriteResultCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%10p] BO - Request %p, LUN: %u, Bulk-Out Write Status: %s (0x%x)\n", 
							( void * ) gTraceBuffer[index].arg1, ( void * ) gTraceBuffer[index].arg4, ( unsigned int ) gTraceBuffer[index].arg3, errorString, ( unsigned int ) gTraceBuffer[index].arg2 );
				
