apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
			}
			break;
		
			case kBODoubleCompleteionCode:
			{
				
				printf ( "[%10p] BO - DOUBLE Completion\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kBOCompletionDuringTerminationCode:
			{
				
				printf ( "[%10p] BO - Completion during termination\n", ( void * ) gTraceBuffer[index].arg1 );
				
			}
			break;
			
			case kBOCompletionCode:
			{
				
				errorString = StringFromReturnCode ( gTraceBuffer[index].arg2 );
				printf ( "[%10p] BO - Completion, State: %s, Status: %s (0x%x), for Request: %p\n", 
								( void * ) gTraceBuffer[index].arg1, kBulkOnlyStateNames [ (int) gTraceBuffer[index].arg3 ], 
								errorString, ( unsigned int ) gTraceBuffer[index].arg2, ( void * ) gTraceBuffer[index].arg4 );
				
			}
			break;
			
			default:
			{
				
				if ( ( type >= 0x05278800 ) && ( type <= 0x05278BFC ) )
				{
					printf ( "[%10p] ??? - UNEXPECTED USB TRACE POINT - %p\n", ( void * ) gTraceBuffer[index].arg1, ( void * ) type );
				}
				
			}
			break;
			
		}
		
	}
	
	fflush ( 0 );
	
}


//-----------------------------------------------------------------------------
//	Quit
//-----------------------------------------------------------------------------

static void
Quit ( const char * s )
{
	
	USBSysctlArgs	args;
	int				error;
	
	if ( gTraceEnabled == TRUE )
		EnableTraceBuffer ( 0 );
	
	if ( gSetRemoveFlag == TRUE )
		RemoveTraceBuffer ( );
	
	args.type = kUSBTypeDebug;
	args.debugFlags = 0;
	
	error = sysctlbyname ( USBMASS_SYSCTL, NULL, NULL, &args, sizeof ( args ) );
	if ( error != 0 )
	{
		fprintf ( stderr, "sysctlbyname failed to set old UMC trace flags back\n" );
	}
	
	fprintf ( stderr, "%s: ", gProgramName );
	if ( s != NULL )
	{
		fprintf ( stderr, "%s", s );
	}
	
	exit ( 1 );
	
}


//-----------------------------------------------------------------------------
//	GetDivisor
//-----------------------------------------------------------------------------

static void
GetDivisor ( void )
{
	
	struct mach_timebase_info	mti;
	
	mach_timebase_info ( &mti );
	
	gDivisor = ( ( double ) mti.denom / ( double ) mti.numer) * 1000;
	
}


//-----------------------------------------------------------------------------
//	LoadUSBMassStorageExtension
//-----------------------------------------------------------------------------

static void
LoadUSBMassStorageExtension ( void )
{

	posix_spawn_file_actions_t	fileActions;
	char * const				argv[]	= { ( char * ) "/sbin/kextload", ( char * ) "/System/Library/Extensions/IOUSBMassStorageClass.kext", NULL };
	char * const				env[]	= { NULL };
	pid_t						child	= 0;
	union wait 					status;
	
	posix_spawn_file_actions_init ( &fileActions );
	posix_spawn_file_actions_addclose ( &fileActions, STDOUT_FILENO );
	posix_spawn_file_actions_addclose ( &fileActions, STDERR_FILENO );
	
	posix_spawn ( &child, "/sbin/kextload", &fileActions, NULL, argv, env );
	
	if ( !( ( wait4 ( child, ( int * ) &status, 0, NULL ) == child ) && ( WIFEXITED ( status ) ) ) )
	{
		printf ( "Error loading USB Mass Storage extension\n" );
	}	
	
	posix_spawn_file_actions_destroy ( &fileActions );

}


//-----------------------------------------------------------------------------
//	StringFromReturnCode
//-----------------------------------------------------------------------------

static const char * 
StringFromReturnCode ( unsigned int returnCode )
{
	
	const char *	string = "UNKNOWN";
	unsigned int	i;
	
	static ReturnCodeSpec	sReturnCodeSpecs[] =
	{
		
		//	USB Return codes
		{ kIOUSBUnknownPipeErr,								"kIOUSBUnknownPipeErr" },
		{ kIOUSBTooManyPipesErr,							"kIOUSBTooManyPipesErr" },
		{ kIOUSBNoAsyncPortErr,								"kIOUSBNoAsyncPortErr" },
		{ kIOUSBNotEnoughPipesErr,							"kIOUSBNotEnoughPipesErr" },
		{ kIOUSBNotEnoughPowerErr,							"kIOUSBNotEnoughPowerErr" },
		{ kIOUSBEndpointNotFound,							"kIOUSBEndpointNotFound" },
		{ kIOUSBConfigNotFound,								"kIOUSBConfigNotFound" },
		{ kIOUSBTransactionTimeout,							"kIOUSBTransactionTimeout" },
		{ kIOUSBTransactionReturned,						"kIOUSBTransactionReturned" },
		{ kIOUSBPipeStalled,								"kIOUSBPipeStalled" },
		{ kIOUSBInterfaceNotFound,							"kIOUSBInterfaceNotFound" },
		{ kIOUSBLowLatencyBufferNotPreviouslyAllocated,		"kIOUSBLowLatencyBufferNotPreviouslyAllocated" },
		{ kIOUSBLowLatencyFrameListNotPreviouslyAllocated,	"kIOUSBLowLatencyFrameListNotPreviouslyAllocated" },
		{ kIOUSBHighSpeedSplitError,						"kIOUSBHighSpeedSplitError" },
		{ kIOUSBSyncRequestOnWLThread,						"kIOUSBSyncRequestOnWLThread" },
		{ kIOUSBDeviceNotHighSpeed,							"kIOUSBDeviceNotHighSpeed" },
		{ kIOUSBLinkErr,									"kIOUSBLinkErr" },
		{ kIOUSBNotSent2Err,								"kIOUSBNotSent2Err" },
		{ kIOUSBNotSent1Err,								"kIOUSBNotSent1Err" },
		{ kIOUSBBufferUnderrunErr,							"kIOUSBBufferUnderrunErr" },
		{ kIOUSBBufferOverrunErr,							"kIOUSBBufferOverrunErr" },
		{ kIOUSBReserved2Err,								"kIOUSBReserved2Err" },
		{ kIOUSBReserved1Err,								"kIOUSBReserved1Err" },
		{ kIOUSBWrongPIDErr,								"kIOUSBWrongPIDErr" },
		{ kIOUSBPIDCheckErr,								"kIOUSBPIDCheckErr" },
		{ kIOUSBDataToggleErr,								"kIOUSBDataToggleErr" },
		{ kIOUSBBitstufErr,									"kIOUSBBitstufErr" },
		{ kIOUSBCRCErr,										"kIOUSBCRCErr" },
		
		//	IOReturn codes
		{ kIOReturnSuccess,									"kIOReturnSuccess" },
		{ kIOReturnError,									"kIOReturnError" },
		{ kIOReturnNoMemory,								"kIOReturnNoMemory" },
		{ kIOReturnNoResources,								"kIOReturnNoResources" },
		{ kIOReturnIPCError,								"kIOReturnIPCError" },
		{ kIOReturnNoDevice,								"kIOReturnNoDevice" },
		{ kIOReturnNotPrivileged,							"kIOReturnNotPrivileged" },
		{ kIOReturnBadArgument,								"kIOReturnBadArgument" },
		{ kIOReturnLockedRead,								"kIOReturnLockedRead" },
		{ kIOReturnLockedWrite,								"kIOReturnLockedWrite" },
		{ kIOReturnExclusiveAccess,							"kIOReturnExclusiveAccess" },
		{ kIOReturnBadMessageID,							"kIOReturnBadMessageID" },
		{ kIOReturnUnsupported,								"kIOReturnUnsupported" },
		{ kIOReturnVMError,									"kIOReturnVMError" },
		{ kIOReturnInternalError,							"kIOReturnInternalError" },
		{ kIOReturnIOError,									"kIOReturnIOError" },
		{ kIOReturnCannotLock,								"kIOReturnCannotLock" },
		{ kIOReturnNotOpen,									"kIOReturnNotOpen" },
		{ kIOReturnNotReadable,								"kIOReturnNotReadable" },
		{ kIOReturnNotWritable,								"kIOReturnNotWritable" },
		{ kIOReturnNotAligned,								"kIOReturnNotAligned" },
		{ kIOReturnBadMedia,								"kIOReturnBadMedia" },
		{ kIOReturnStillOpen,								"kIOReturnStillOpen" },
		{ kIOReturnRLDError,								"kIOReturnRLDError" },
		{ kIOReturnDMAError,								"kIOReturnDMAError" },
		{ kIOReturnBusy,									"kIOReturnBusy" },
		{ kIOReturnTimeout,									"kIOReturnTimeout" },
		{ kIOReturnOffline,									"kIOReturnOffline" },
		{ kIOReturnNotReady,								"kIOReturnNotReady" },
		{ kIOReturnNotAttached,								"kIOReturnNotAttached" },
		{ kIOReturnNoChannels,								"kIOReturnNoChannels" },
		{ kIOReturnNoSpace,									"kIOReturnNoSpace" },
		{ kIOReturnPortExists,								"kIOReturnPortExists" },
		{ kIOReturnCannotWire,								"kIOReturnCannotWire" },
		{ kIOReturnNoInterrupt,								"kIOReturnNoInterrupt" },
		{ kIOReturnNoFrames,								"kIOReturnNoFrames" },
		{ kIOReturnMessageTooLarge,							"kIOReturnMessageTooLarge" },
		{ kIOReturnNotPermitted,							"kIOReturnNotPermitted" },
		{ kIOReturnNoPower,									"kIOReturnNoPower" },
		{ kIOReturnNoMedia,									"kIOReturnNoMedia" },
		{ kIOReturnUnformattedMedia,						"kIOReturnUnformattedMedia" },
		{ kIOReturnUnsupportedMode,							"kIOReturnUnsupportedMode" },
		{ kIOReturnUnderrun,								"kIOReturnUnderrun" },
		{ kIOReturnOverrun,									"kIOReturnOverrun" },
		{ kIOReturnDeviceError,								"kIOReturnDeviceError" },
		{ kIOReturnNoCompletion,							"kIOReturnNoCompletion" },
		{ kIOReturnAborted,									"kIOReturnAborted" },
		{ kIOReturnNoBandwidth,								"kIOReturnNoBandwidth" },
		{ kIOReturnNotResponding,							"kIOReturnNotResponding" },
		{ kIOReturnIsoTooOld,								"kIOReturnIsoTooOld" },
		{ kIOReturnIsoTooNew,								"kIOReturnIsoTooNew" },
		{ kIOReturnNotFound,								"kIOReturnNotFound" },
		{ kIOReturnInvalid,									"kIOReturnInvalid" }
	};
	
	for ( i = 0; i < ( sizeof ( sReturnCodeSpecs ) / sizeof ( sReturnCodeSpecs[0] ) ); i++ )
	{
		
		if ( returnCode == sReturnCodeSpecs[i].returnCode )
		{
			
			string = sReturnCodeSpecs[i].string;
			break;
			
