apple-open-source/macos/IOUSBMassStorageClass/UMCLogger/UMCLogger.cpp
        }
        break;
            
        case kAppleUSBCardReaderUMC_waitForReconnect:
        {
            
            if ( gTraceBuffer[index].arg4 != 0 )
            {
                printf ( "[%10p] AUCRU - GatedWaitForReconnect exiting returned=0x%x\n", ( void * ) gTraceBuffer[index].arg2, ( int ) gTraceBuffer[index].arg3 );
            }
            
            else
            {
                printf ( "[%10p] AUCRU - GatedWaitForReconnect entered returned=0x%x\n", ( void * ) gTraceBuffer[index].arg2, ( int ) gTraceBuffer[index].arg3 );
            }
            
        }
        break;
            
        case kAppleUSBCardReaderUMC_systemWillShutdown:
        {
            printf ( "[%10p] AUCRU - systemWillShutdown specifier=0x%x\n", ( void * ) gTraceBuffer[index].arg2, ( int ) gTraceBuffer[index].arg3 );
        }
        break;
            
        case kAppleUSBCardReaderUMC_generalPurpose:
        {
            printf ( "[%10p] AUCRU - General Purpose 0x%x 0x%x\n", ( void * ) gTraceBuffer[index].arg2,
                     ( int ) gTraceBuffer[index].arg3, ( int ) gTraceBuffer[index].arg4 );
        }
        break;
            
        default:
        {
            printf ( "Recieved request for intSubclassCode=0x%lx for AppleUSBCardReaderUMC, but know of no such intSubclassCode\n", ( unsigned long ) inSubclassCode );
        }
            
    }
    
}


//-----------------------------------------------------------------------------
//	EOF
//-----------------------------------------------------------------------------
